#### 4.2.4.2. 수식 및 조건식 기반 데이터 처리

In [17]:
import numpy as np
import pandas as pd
import seaborn as sns

In [3]:
tips = sns.load_dataset('tips')

In [4]:
# 단일 조건 필터링: 식사 금액이 20달러 이상인 경우
tips.query('total_bill >= 20')

     total_bill   tip     sex smoker  day    time  size
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
5         25.29  4.71    Male     No  Sun  Dinner     4
7         26.88  3.12    Male     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
237       32.83  1.17    Male    Yes  Sat  Dinner     2
238       35.83  4.67  Female     No  Sat  Dinner     3
239       29.03  5.92    Male     No  Sat  Dinner     3
240       27.18  2.00  Female    Yes  Sat  Dinner     2
241       22.67  2.00    Male    Yes  Sat  Dinner     2

[97 rows x 7 columns]

In [7]:
# 다중 조건 필터링: 식사 인원 수가 3명 이상이고, 목요일에 방문한 경우
# tips.query('size >= 3 and day == "Thur"')
tips.query('(size >= 3)  & (day == "Thur")')

     total_bill   tip     sex smoker   day   time  size
77        27.20  4.00    Male     No  Thur  Lunch     4
85        34.83  5.17  Female     No  Thur  Lunch     4
119       24.08  2.92  Female     No  Thur  Lunch     4
125       29.80  4.20  Female     No  Thur  Lunch     6
129       22.82  2.18    Male     No  Thur  Lunch     3
141       34.30  6.70    Male     No  Thur  Lunch     6
142       41.19  5.00    Male     No  Thur  Lunch     5
143       27.05  5.00  Female     No  Thur  Lunch     6
146       18.64  1.36  Female     No  Thur  Lunch     3
197       43.11  5.00  Female    Yes  Thur  Lunch     4
200       18.71  4.00    Male    Yes  Thur  Lunch     3
204       20.53  4.00    Male    Yes  Thur  Lunch     4
205       16.47  3.23  Female    Yes  Thur  Lunch     3

In [10]:
# 외부 변수 사용: 기준 팁 금액 미만인 경우
min_tip_required = 5
tips.query('tip < @min_tip_required')  # @ 꼭 써야 함!

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
238       35.83  4.67  Female     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[216 rows x 7 columns]

In [14]:
# 기준 팁 금액보다 적게준 경우는 216팀임.
tips.query('tip < @min_tip_required').shape[0]
len(tips.query('tip < @min_tip_required'))

216

216

### 4.2.5. 시계열 데이터 처리
#### 4.2.5.1. 시계열 데이터

In [18]:
# 타임스탬프
pd.Timestamp('2023-05-15 09:21')

Timestamp('2023-05-15 09:21:00')

In [20]:
# 타임 기간
pd.Period('2025-05', freq = 'M')

Period('2025-05', 'M')

In [21]:
# 시간 델타
pd.Timedelta(days = 2, hours = 5)

Timedelta('2 days 05:00:00')

#### 4.2.5.2. 시계열 데이터 형식 변환

In [22]:
# Timestamp1: 문자열 리스트 사용
pd.to_datetime(['2025-03-02', '2025-03-03', '2025-03-04'])

DatetimeIndex(['2025-03-02', '2025-03-03', '2025-03-04'], dtype='datetime64[ns]', freq=None)

In [24]:
#Timestamp2: 명시적 형식 지정
pd.to_datetime(['March 2, 2025', 'March 3, 2025', 'March 4, 2025'], format='%B %d, %Y')

DatetimeIndex(['2025-03-02', '2025-03-03', '2025-03-04'], dtype='datetime64[ns]', freq=None)

In [26]:
# Timestamp3: 오류 발생시 NaT 처리
pd.to_datetime(['2025-03-02', 'not a data'], errors = "coerce")

DatetimeIndex(['2025-03-02', 'NaT'], dtype='datetime64[ns]', freq=None)

In [32]:
# Timestamp4: 정수 데이터프레임 사용
df = pd.DataFrame({
    "year": [2025, 2025],
    "month": [3, 5],
    "day": [2, 5]
})

pd.to_datetime(df)

0   2025-03-02
1   2025-05-05
dtype: datetime64[ns]

In [35]:
# Period: 2025년 3월 1일 ~ 31일 (한 달)
pd.to_datetime('2025-03', format = '%Y-%m').to_period('M')

Period('2025-03', 'M')

In [37]:
# Timedelta
pd.to_datetime('2025-05-15') - pd.to_datetime('2025-03-02')  # 74일 지남

Timedelta('74 days 00:00:00')

In [42]:
# 하루씩 증가하는 날짜 시퀀스
pd.date_range('2025-03-02', periods = 5, freq = 'D')

DatetimeIndex(['2025-03-02', '2025-03-03', '2025-03-04', '2025-03-05',
               '2025-03-06'],
              dtype='datetime64[ns]', freq='D')

In [44]:
# 일주일씩 증가하는 날짜 시퀀스(일요일 기준)
pd.date_range('2025-05-15', periods = 5, freq = 'W')

DatetimeIndex(['2025-05-18', '2025-05-25', '2025-06-01', '2025-06-08',
               '2025-06-15'],
              dtype='datetime64[ns]', freq='W-SUN')

In [58]:
# 힌 달씩 증가하는 날짜 시퀀스(월말 기준)
pd.date_range('2025-05-15', periods = 5, freq ='M')

DatetimeIndex(['2025-05-31', '2025-06-30', '2025-07-31', '2025-08-31',
               '2025-09-30'],
              dtype='datetime64[ns]', freq='M')

In [52]:
# 2025년 3월부터 시작하여 3개월 동안의 기간
pd.period_range('2025-03', periods = 3, freq = 'M')

PeriodIndex(['2025-03', '2025-04', '2025-05'], dtype='period[M]', freq='M')

In [55]:
# 1시간 간격의 시간 델타 시퀀스
pd.timedelta_range(start = '0s', periods = 5, freq = 'h')

TimedeltaIndex(['0 days 00:00:00', '0 days 01:00:00', '0 days 02:00:00',
                '0 days 03:00:00', '0 days 04:00:00'],
               dtype='timedelta64[ns]', freq='H')

#### 4.2.5.3. 시계열 데이터 인덱스와 필터링

In [69]:
# 시계열 데이터 인덱스 설정
date_rng = pd.date_range(start= '2024-12-20', end = '2025-1-10', freq = 'D')
len(date_rng)

22

In [70]:
np.random.randint(0, 100, size = 22)

array([85, 35, 78, 86, 61, 89, 99, 10, 98, 29, 16, 84, 20, 74, 20, 45, 70,
       84, 62, 43, 51, 94])

In [72]:
df = pd.DataFrame({'value': np.random.randint(0, 100, size = len(date_rng))}, index = date_rng)
df

            value
2024-12-20     92
2024-12-21     49
2024-12-22     97
2024-12-23     51
2024-12-24      2
2024-12-25     22
2024-12-26     22
2024-12-27     27
2024-12-28     67
2024-12-29     85
2024-12-30     52
2024-12-31     24
2025-01-01     12
2025-01-02     54
2025-01-03     43
2025-01-04      1
2025-01-05     84
2025-01-06      4
2025-01-07     82
2025-01-08     24
2025-01-09     63
2025-01-10     67

In [74]:
# 날짜 기반 필터링: 특정 연도 데이터
print(df.loc['2025'])

            value
2025-01-01     12
2025-01-02     54
2025-01-03     43
2025-01-04      1
2025-01-05     84
2025-01-06      4
2025-01-07     82
2025-01-08     24
2025-01-09     63
2025-01-10     67

In [73]:
# 날짜 기반 필터링: 특정 날짜 이후 데이터
df.loc['2025-01-04':]

            value
2025-01-04      1
2025-01-05     84
2025-01-06      4
2025-01-07     82
2025-01-08     24
2025-01-09     63
2025-01-10     67

In [75]:
df.loc['2024-12-24': '2024-12-31']

            value
2024-12-24      2
2024-12-25     22
2024-12-26     22
2024-12-27     27
2024-12-28     67
2024-12-29     85
2024-12-30     52
2024-12-31     24

In [80]:
df.index.month_name()  # 월의 이름이 숫자가 아닌 영어로 나옴

Index(['December', 'December', 'December', 'December', 'December', 'December',
       'December', 'December', 'December', 'December', 'December', 'December',
       'January', 'January', 'January', 'January', 'January', 'January',
       'January', 'January', 'January', 'January'],
      dtype='object')

In [82]:
df.index.day_name()

Index(['Friday', 'Saturday', 'Sunday', 'Monday', 'Tuesday', 'Wednesday',
       'Thursday', 'Friday', 'Saturday', 'Sunday', 'Monday', 'Tuesday',
       'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday', 'Monday',
       'Tuesday', 'Wednesday', 'Thursday', 'Friday'],
      dtype='object')

In [85]:
# 0 = 월요일
df.index.dayofweek

Int64Index([4, 5, 6, 0, 1, 2, 3, 4, 5, 6, 0, 1, 2, 3, 4, 5, 6, 0, 1, 2, 3, 4], dtype='int64')

In [88]:
df.sort_index(ascending = False)  # 날짜 내림차순

            value
2025-01-10     67
2025-01-09     63
2025-01-08     24
2025-01-07     82
2025-01-06      4
2025-01-05     84
2025-01-04      1
2025-01-03     43
2025-01-02     54
2025-01-01     12
2024-12-31     24
2024-12-30     52
2024-12-29     85
2024-12-28     67
2024-12-27     27
2024-12-26     22
2024-12-25     22
2024-12-24      2
2024-12-23     51
2024-12-22     97
2024-12-21     49
2024-12-20     92

#### 4.2.5.4. 시계열 데이터 처리 및 시각화

In [89]:
flights = sns.load_dataset('flights')

In [90]:
flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        144 non-null    int64
 1   month       144 non-null    category
 2   passengers  144 non-null    int64
dtypes: category(1), int64(2)
memory usage: 2.9 KB

In [91]:
flights.head

<bound method NDFrame.head of      year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]>

In [100]:
flights['year'].astype(str) + '-' + flights['month'].astype(str)

0      1949-Jan
1      1949-Feb
2      1949-Mar
3      1949-Apr
4      1949-May
         ...
139    1960-Aug
140    1960-Sep
141    1960-Oct
142    1960-Nov
143    1960-Dec
Length: 144, dtype: object

In [103]:
flights['date'] = pd.to_datetime(flights['year'].astype(str) + '-' + flights['month'].astype(str), format="%Y-%b")
flights.head()

   year month  passengers       date
0  1949   Jan         112 1949-01-01
1  1949   Feb         118 1949-02-01
2  1949   Mar         132 1949-03-01
3  1949   Apr         129 1949-04-01
4  1949   May         121 1949-05-01

In [105]:
flights.set_index('date', inplace = True)

In [108]:
flights.drop(['year', 'month'], axis = 1, inplace = True)

In [109]:
flights.head()

            passengers
date
1949-01-01         112
1949-02-01         118
1949-03-01         132
1949-04-01         129
1949-05-01         121

In [122]:
# 리샘플링: 월별 데이터 -> 연간 데이터(연도별 총합)
annual_passengers =  flights.resample('Y').sum()

In [128]:
# 시간 이동: 직전 분시ㅡ대비 승객 수 증감률
# ((현재 분기 승객 수) - (직전 분기 승객 수)) / (직전 분기 승객 수) * 100
quarterly = flights ['passengers'].resample('Q').sum()
previous_quarter = quarterly.shift(1)
change_rate = (quarterly-previous_quarter) / previous_quarter * 100

In [131]:
quarterly_df = pd.DataFrame({
    'quarterly_passengers' : quarterly,
    'previous_quarter' : previous_quarter,
    'change_rete' : change_rate
})

quarterly_df

            quarterly_passengers  previous_quarter  change_rete
date
1949-03-31                   362               NaN          NaN
1949-06-30                   385             362.0     6.353591
1949-09-30                   432             385.0    12.207792
1949-12-31                   341             432.0   -21.064815
1950-03-31                   382             341.0    12.023460
1950-06-30                   409             382.0     7.068063
1950-09-30                   498             409.0    21.760391
1950-12-31                   387             498.0   -22.289157
1951-03-31                   473             387.0    22.222222
1951-06-30                   513             473.0     8.456660
1951-09-30                   582             513.0    13.450292
1951-12-31                   474             582.0   -18.556701
1952-03-31                   544             474.0    14.767932
1952-06-30                   582             544.0     6.985294
1952-09-30                   681             582.0    17.010309
1952-12-31                   557             681.0   -18.208517
1953-03-31                   628             557.0    12.746858
1953-06-30                   707             628.0    12.579618
1953-09-30                   773             707.0     9.335219
1953-12-31                   592             773.0   -23.415265
1954-03-31                   627             592.0     5.912162
1954-06-30                   725             627.0    15.629984
1954-09-30                   854             725.0    17.793103
1954-12-31                   661             854.0   -22.599532
1955-03-31                   742             661.0    12.254160
1955-06-30                   854             742.0    15.094340
1955-09-30                  1023             854.0    19.789227
1955-12-31                   789            1023.0   -22.873900
1956-03-31                   878             789.0    11.280101
1956-06-30                  1005             878.0    14.464692
1956-09-30                  1173            1005.0    16.716418
1956-12-31                   883            1173.0   -24.722933
1957-03-31                   972             883.0    10.079275
1957-06-30                  1125             972.0    15.740741
1957-09-30                  1336            1125.0    18.755556
1957-12-31                   988            1336.0   -26.047904
1958-03-31                  1020             988.0     3.238866
1958-06-30                  1146            1020.0    12.352941
1958-09-30                  1400            1146.0    22.164049
1958-12-31                  1006            1400.0   -28.142857
1959-03-31                  1108            1006.0    10.139165
1959-06-30                  1288            1108.0    16.245487
1959-09-30                  1570            1288.0    21.894410
1959-12-31                  1174            1570.0   -25.222930
1960-03-31                  1227            1174.0     4.514480
1960-06-30                  1468            1227.0    19.641402
1960-09-30                  1736            1468.0    18.256131
1960-12-31                  1283            1736.0   -26.094470

In [134]:
# 롤링 윈도우: 12개월 단순 이동 평균
flights['moving_avg_12months'] = flights['passengers'].rolling(window = 12).mean()